In [1]:
import pandas as pd
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

In [2]:
df = pd.read_csv("titanic.txt")

In [3]:
df.drop(['SexCode'], axis=1, inplace=True)

In [4]:
df.drop(df[df['Sex']!='male'].index)

                                     Name PClass    Age   Sex  Survived
2     Allison, Mr Hudson Joshua Creighton    1st  30.00  male         0
4           Allison, Master Hudson Trevor    1st   0.92  male         1
5                      Anderson, Mr Harry    1st  47.00  male         1
7                  Andrews, Mr Thomas, jr    1st  39.00  male         0
9                  Artagaveytia, Mr Ramon    1st  71.00  male         0
...                                   ...    ...    ...   ...       ...
1308                   Zakarian, Mr Artun    3rd  27.00  male         0
1309               Zakarian, Mr Maprieder    3rd  26.00  male         0
1310                     Zenni, Mr Philip    3rd  22.00  male         0
1311                     Lievens, Mr Rene    3rd  24.00  male         0
1312                       Zimmerman, Leo    3rd  29.00  male         0

[851 rows x 5 columns]

In [5]:
df.drop_duplicates(subset=['Sex'], keep='last')

                     Name PClass   Age     Sex  Survived
1307  Zabour, Miss Tamini    3rd   NaN  female         0
1312       Zimmerman, Leo    3rd  29.0    male         0

In [6]:
df.groupby(['Sex']).count()

        Name  PClass  Age  Survived
Sex
female   462     462  288       462
male     851     851  468       851

In [7]:
df.groupby(['Sex', 'Survived']).mean()

                       Age
Sex    Survived
female 0         24.901408
       1         30.867143
male   0         32.320780
       1         25.951875

In [10]:
for name in df['Name'][:10]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE
ALLISON, MR HUDSON JOSHUA CREIGHTON
ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)
ALLISON, MASTER HUDSON TREVOR
ANDERSON, MR HARRY
ANDREWS, MISS KORNELIA THEODOSIA
ANDREWS, MR THOMAS, JR
APPLETON, MRS EDWARD DALE (CHARLOTTE LAMSON)
ARTAGAVEYTIA, MR RAMON

In [11]:
def uppercase(x):
    return x.upper()

In [12]:
df['Name'].apply(uppercase)

0                        ALLEN, MISS ELISABETH WALTON
1                         ALLISON, MISS HELEN LORAINE
2                 ALLISON, MR HUDSON JOSHUA CREIGHTON
3       ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)
4                       ALLISON, MASTER HUDSON TREVOR
                            ...
1308                               ZAKARIAN, MR ARTUN
1309                           ZAKARIAN, MR MAPRIEDER
1310                                 ZENNI, MR PHILIP
1311                                 LIEVENS, MR RENE
1312                                   ZIMMERMAN, LEO
Name: Name, Length: 1313, dtype: object

In [14]:
data_a = {'id': ['1', '2', '3'],
          'name': ['Conor', 'Jon', 'Jorge'],
          'surname': ['McGregor', 'Jones', 'Masvidal']}
data_b = {'id': ['4', '5', '6'],
          'name': ['Roger', 'Maria', 'Rafael'],
          'surname': ['Federer', 'Sharapova', 'Nadal']}

In [15]:
df_a = pd.DataFrame(data_a)
df_b = pd.DataFrame(data_b)

In [17]:
pd.concat([df_a, df_b], ignore_index = True)

  id    name    surname
0  1   Conor   McGregor
1  2     Jon      Jones
2  3   Jorge   Masvidal
3  4   Roger    Federer
4  5   Maria  Sharapova
5  6  Rafael      Nadal

In [19]:
employee_data = {'employee_id': ['1', '2', '3', '4'],
          'name': ['Roger', 'Maria', 'Rafael', 'Serena'],
          'surname': ['Federer', 'Sharapova', 'Nadal', 'Williams']}
sales_data = {'employee_id': ['3', '4', '5', '6'],
              'total_sales': ['3445', '5312', '4123', '1234']}

In [20]:
emp = pd.DataFrame(employee_data)
dat = pd.DataFrame(sales_data)

In [22]:
pd.merge(emp, dat, on='employee_id', how='outer')

  employee_id    name    surname total_sales
0           1   Roger    Federer         NaN
1           2   Maria  Sharapova         NaN
2           3  Rafael      Nadal        3445
3           4  Serena   Williams        5312
4           5     NaN        NaN        4123
5           6     NaN        NaN        1234